In [1]:
%load_ext sql

In [2]:
%%sql
sqlite:///CourseDataWareHouse.db

'Connected: @CourseDataWareHouse.db'

## Domain integrity

Check Data Types for tables

In [3]:
%%sql
SELECT typeof(CC_ID),typeof(COURSE_TITLE),typeof(PRE_REQS),typeof(CO_REQS)
FROM COURSES
limit 1;

 * sqlite:///CourseDataWareHouse.db
(sqlite3.OperationalError) no such column: CC_ID [SQL: 'SELECT typeof(CC_ID), typeof(COURSE_TITLE), typeof(PRE_REQS),typeof(CO_REQS)\nFROM COURSES\nlimit 1;'] (Background on this error at: http://sqlalche.me/e/e3q8)

In [8]:
%%sql
SELECT typeof(ROOM_ID),typeof(ROOM_NO)
FROM MEETINGS
limit 1;

 * sqlite:///CourseDataWareHouse.db
Done.

[]

In [9]:
%%sql
SELECT typeof(I_ID),typeof(NAME),typeof(COURSE_TITLE)
FROM PROFESSOR
limit 1;

 * sqlite:///CourseDataWareHouse.db
(sqlite3.OperationalError) no such table: PROFESSOR [SQL: 'SELECT typeof(I_ID),typeof(NAME),typeof(COURSE_TITLE)\nFROM PROFESSOR\nlimit 1;'] (Background on this error at: http://sqlalche.me/e/e3q8)

In [71]:
%%sql
SELECT typeof(CM_ID), typeof(CRN), typeof(CAP), typeof(ACT),
typeof(REM), typeof(SECTION)
FROM COURSE_MEETING
limit 1;

 * sqlite:///CourseData.db
Done.

[('integer', 'integer', 'integer', 'integer', 'integer', 'text')]

In [72]:
%%sql
SELECT typeof(ROOM_ID), typeof(Room_No), typeof(CRN)
FROM LOCATION
limit 1;

 * sqlite:///CourseData.db
Done.

[('integer', 'text', 'integer')]

In [67]:
%%sql
SELECT typeof(TERM_ID), typeof(TERM_NAME), typeof(CRN)
FROM TERM
limit 1;

 * sqlite:///CourseData.db
Done.

[('integer', 'text', 'integer')]

In [73]:
%%sql
SELECT typeof(TIME_ID), typeof(START_TIME), typeof(END_TIME), typeof(CRN)
FROM TIME_CODE
limit 1;

 * sqlite:///CourseData.db
Done.

[('integer', 'text', 'text', 'integer')]

In [74]:
%%sql
SELECT typeof(I_ID), typeof(NAME), typeof(COURSE_TITLE), typeof(CRN)
FROM INSTRUCTOR
limit 1;

 * sqlite:///CourseData.db
Done.

[('integer', 'text', 'text', 'integer')]

## Entity integrity

Check for duplicates in tables

In [19]:
%%sql
SELECT COUNT(CATALOG_ID)
FROM CATALOG_PROGRAM;

 * sqlite:///CourseData.db
Done.

[(2220,)]

In [12]:
%%sql
SELECT DISTINCT COUNT(CATALOG_ID)
FROM CATALOG_PROGRAM;

 * sqlite:///CourseData.db
Done.

[(2220,)]

In [29]:
%%sql
SELECT COUNT(CC_ID)
FROM CATALOG_COURSE;

 * sqlite:///CourseData.db
Done.

[(2220,)]

In [30]:
%%sql
SELECT DISTINCT COUNT(CC_ID)
FROM CATALOG_COURSE;

 * sqlite:///CourseData.db
Done.

[(2220,)]

In [33]:
%%sql
SELECT COUNT(COURSE_TITLE)
FROM COURSE_OFFERING;

 * sqlite:///CourseData.db
Done.

[(14330,)]

In [34]:
%%sql
SELECT DISTINCT COUNT(COURSE_TITLE)
FROM COURSE_OFFERING;

 * sqlite:///CourseData.db
Done.

[(14330,)]

In [35]:
%%sql
SELECT COUNT(CM_ID)
FROM COURSE_MEETING;

 * sqlite:///CourseData.db
Done.

[(15908,)]

In [36]:
%%sql
SELECT DISTINCT COUNT(CM_ID)
FROM COURSE_MEETING;

 * sqlite:///CourseData.db
Done.

[(15908,)]

In [18]:
%%sql
SELECT COUNT(Room_No)
FROM Location;

 * sqlite:///CourseData.db
Done.

[(13731,)]

In [17]:
%%sql
SELECT DISTINCT COUNT(Room_No)
FROM Location;

 * sqlite:///CourseData.db
Done.

[(13731,)]

In [37]:
%%sql
SELECT COUNT(CRN)
FROM Term;

 * sqlite:///CourseData.db
Done.

[(12697,)]

In [38]:
%%sql
SELECT DISTINCT COUNT(CRN)
FROM Term;

 * sqlite:///CourseData.db
Done.

[(12697,)]

In [20]:
%%sql
SELECT COUNT(Name)
FROM Instructor;

 * sqlite:///CourseData.db
Done.

[(14329,)]

In [21]:
%%sql
SELECT DISTINCT COUNT(Name)
FROM Instructor;

 * sqlite:///CourseData.db
Done.

[(14329,)]

In [39]:
%%sql
SELECT COUNT(CRN)
FROM Time_Code;

 * sqlite:///CourseData.db
Done.

[(296781,)]

In [40]:
%%sql
SELECT DISTINCT COUNT(CRN)
FROM Time_Code;

 * sqlite:///CourseData.db
Done.

[(296781,)]

## Relational integrity

Foreign Keys Joins compatible with the Primary Keys

In [42]:
%%sql
SELECT *
FROM CATALOG_PROGRAM a, CATALOG_COURSE b
WHERE a.CATALOG_ID=b.CATALOG_ID
limit 1;

 * sqlite:///CourseData.db
Done.

[('AN 0301', 'AN', 'Asian Studies', 'Independent Study', 1, 'Independent Study', None, None, 'AN 0301')]

In [43]:
%%sql
SELECT *
FROM CATALOG_COURSE a, COURSE_OFFERING b
WHERE a.COURSE_TITLE=b.COURSE_TITLE
limit 1;

 * sqlite:///CourseData.db
Done.

[(1, 'Independent Study', None, None, 'AN 0301', 6629, 11628, 'DG', 'Independent Study', '1.000')]

In [44]:
%%sql
SELECT *
FROM COURSE_OFFERING a, TERM b
WHERE a.CRN=b.CRN
limit 1;

 * sqlite:///CourseData.db
Done.

[(1, 70384, 'C01', 'Introduction to Financial Accounting', '3.000', 1, 'Fall2014', 70384)]

In [45]:
%%sql
SELECT *
FROM COURSE_OFFERING a, INSTRUCTOR b
WHERE a.CRN=b.CRN
limit 1;

 * sqlite:///CourseData.db
Done.

[(1, 70384, 'C01', 'Introduction to Financial Accounting', '3.000', 1, 'Michael P.  Coyne', 'Introduction to Financial Accounting', 70384)]

In [46]:
%%sql
SELECT *
FROM COURSE_OFFERING a, COURSE_MEETING b
WHERE a.SECTION=b.SECTION
limit 1;

 * sqlite:///CourseData.db
Done.

[(1, 70384, 'C01', 'Introduction to Financial Accounting', '3.000', 434, 70015, 0, 19, -19, 'C01')]

In [47]:
%%sql
SELECT *
FROM COURSE_OFFERING a, TIME_CODE b
WHERE a.CRN=b.CRN
limit 1;

 * sqlite:///CourseData.db
Done.

[(1, 70384, 'C01', 'Introduction to Financial Accounting', '3.000', 1, '2014-09-02T08:00:00', '2014-09-02T09:15:00', 70384)]

In [48]:
%%sql
SELECT *
FROM COURSE_MEETING a, LOCATION b
WHERE a.CRN=b.CRN
limit 1;

 * sqlite:///CourseData.db
Done.

[(1, 70384, 0, 31, -31, 'C01', 1, 'DSB 105', 70384)]